<a href="https://colab.research.google.com/github/Almattony/Data-science_numpy/blob/main/_3series_metodlari.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [21]:
from pandas import Series, DataFrame as df

In [4]:
lugat = {'Malibu' : 40000, 'Lasetti': 20000, 'Toyota': '450000', 'Mazda': 52000, "Honda" : 38000}
lugat

{'Malibu': 40000,
 'Lasetti': 20000,
 'Toyota': '450000',
 'Mazda': 52000,
 'Honda': 38000}

In [5]:
cars = Series({'Malibu' : 40000, 'Lasetti': 20000, 'Toyota': '450000', 'Mazda': 52000, "Honda" : 38000})

In [6]:
cars

Malibu      40000
Lasetti     20000
Toyota     450000
Mazda       52000
Honda       38000
dtype: object

In [10]:
models = ['Honda', 'Mazda', 'Lasetti', 'Jaguar', 'Malibu', 'Toyota', 'BMW', 'Mercedes']

In [11]:
cars2 = Series(cars, index = models)

In [12]:
cars2

Honda        38000
Mazda        52000
Lasetti      20000
Jaguar         NaN
Malibu       40000
Toyota      450000
BMW            NaN
Mercedes       NaN
dtype: object

In [13]:
cars2.isnull() # bu metod Series ichidagi malumotlarni tekshirib NaN qiymatidagilarni True qilib qaytaradi

Honda       False
Mazda       False
Lasetti     False
Jaguar       True
Malibu      False
Toyota      False
BMW          True
Mercedes     True
dtype: bool

In [14]:
cars2.notnull() #bu esa malumotlarning ichida NaN qiymatilarni False turda qaytaradi

Honda        True
Mazda        True
Lasetti      True
Jaguar      False
Malibu       True
Toyota       True
BMW         False
Mercedes    False
dtype: bool

In [15]:
cars2

Honda        38000
Mazda        52000
Lasetti      20000
Jaguar         NaN
Malibu       40000
Toyota      450000
BMW            NaN
Mercedes       NaN
dtype: object

In [16]:
cars

Malibu      40000
Lasetti     20000
Toyota     450000
Mazda       52000
Honda       38000
dtype: object

In [17]:
cars + cars2

BMW                  NaN
Honda              76000
Jaguar               NaN
Lasetti            40000
Malibu             80000
Mazda             104000
Mercedes             NaN
Toyota      450000450000
dtype: object

In [18]:
cars2.name = "Avtosalon" # cars2 ga nom berdik

In [19]:
cars2.index.name = "Modellar" # indexlarga ha'm nom bera olamiz

In [20]:
cars2

Modellar
Honda        38000
Mazda        52000
Lasetti      20000
Jaguar         NaN
Malibu       40000
Toyota      450000
BMW            NaN
Mercedes       NaN
Name: Avtosalon, dtype: object

In [22]:
cars.hasnans # Nan qiymatlar bor(True) agar yo'q bolsa (False) qaytaradi

False

In [23]:
cars2.hasnans

True

In [24]:
cars.dtype # qiymatlarning malumot turi yaniy bizda object

dtype('O')

In [26]:
cars2.dtype

dtype('O')

In [27]:
cars2

Modellar
Honda        38000
Mazda        52000
Lasetti      20000
Jaguar         NaN
Malibu       40000
Toyota      450000
BMW            NaN
Mercedes       NaN
Name: Avtosalon, dtype: object

In [29]:
cars2.is_unique # qiymatlar takrorlanmas ekanini tekshirish yaniy biz NaN takrorlangan

False

In [30]:
cars.is_unique

True

In [31]:
cars2.shape

(8,)

In [32]:
cars.shape # Series hajmi

(5,)

In [33]:
cars.size

5

In [35]:
cars2.iloc[2] # malumotlarga indeks tartib raqami boyicha murojat qilish

20000

In [39]:
cars.iloc[4]

38000

In [40]:
cars.iloc[-1]

38000

In [43]:
cars2.loc['Toyota'] # mal/ga indeks boyicha murojat qilish

'450000'

In [46]:
cars2

Modellar
Honda        38000
Mazda        52000
Lasetti      20000
Jaguar         NaN
Malibu       40000
Toyota      450000
BMW            NaN
Mercedes       NaN
Name: Avtosalon, dtype: object

In [47]:
cars

Malibu      40000
Lasetti     20000
Toyota     450000
Mazda       52000
Honda       38000
dtype: object

In [51]:
cars_dict = {'Malibu':40000, 'Lacetti':20000, 'Toyota':45000, 'Mazda':52000, 'Honda':38000}

In [52]:
salon1 = Series(cars_dict)

In [53]:
salon1

Malibu     40000
Lacetti    20000
Toyota     45000
Mazda      52000
Honda      38000
dtype: int64

In [54]:
models = ['Honda','Mazda','Lacetti','Jaguar','Malibu','Toyota']

In [55]:
salon2 = Series(cars_dict, index=models)

In [56]:
salon2

Honda      38000.0
Mazda      52000.0
Lacetti    20000.0
Jaguar         NaN
Malibu     40000.0
Toyota     45000.0
dtype: float64

In [57]:
salon2.min()

20000.0

In [58]:
salon2.max()

52000.0

In [59]:
salon2.mean()

39000.0

In [61]:
nol = Series()

In [62]:
nol

Series([], dtype: object)

In [65]:
type(nol)

pandas.core.series.Series